benchmarks/results/v8-four-cpu-2026-09-18/distributed-2000-trial1.txt
Requests      [total, rate, throughput]         51276, 1709.24, 103.30
Duration      [total, attack, wait]             30.001s, 29.999s, 2.006ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.049ms, 3.34ms, 2.145ms, 3.93ms, 5.66ms, 41.24ms, 175.677ms
Bytes In      [total, mean]                     5238364, 102.16
Bytes Out     [total, mean]                     2820180, 55.00
Success       [ratio]                           6.04%
Status Codes  [code:count]                      200:3099  429:48177  
Error Set:
429 Too Many Requests