benchmarks/results/v8-four-cpu-2026-09-18/single-6000-trial1.txt
Requests      [total, rate, throughput]         29324, 977.48, 96.79
Duration      [total, attack, wait]             30.002s, 30s, 2.195ms
Latencies     [min, mean, 50, 90, 95, 99, max]  109µs, 12.293ms, 3.159ms, 11.501ms, 70.665ms, 197.197ms, 314.398ms
Bytes In      [total, mean]                     2922084, 99.65
Bytes Out     [total, mean]                     1574210, 53.68
Success       [ratio]                           9.90%
Status Codes  [code:count]                      0:702  200:2904  429:25718  
Error Set:
429 Too Many Requests
Post "http://localhost:8083/v1/check": http: server closed idle connection
Post "http://localhost:8083/v1/check": EOF